[Spanish]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Conecte la llave USB de 2,4 GHz del dispositivo al puerto USB del equipo para realizar la asociación.
Please follow the steps below for pairing. = Siga los pasos que se indican a continuación para realizar la asociación.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Establezca el interruptor de conexión en el modo de RF de 2,4 GHz.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Presione sin soltar el botón izquierdo, el botón derecho y el botón PPP durante 3 segundos.
3. Click the "Pair" button on the interface. = 3. Haga clic en el botón “Asociar” de la interfaz.	
1. Connect the device to your computer with the USB cable. = 1. Conecte el dispositivo a su PC mediante el cable USB.
2. Click the "Pair" button on the interface. = 2. Haga clic en el botón “Asociar” de la interfaz.

Pair = Asociar
Close = Cerrar
Pairing = Asociación
Pairing completed = Asociación completada
Pairing failed = Error de asociación

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Conecte el dispositivo al equipo con un cable USB y establezca el interruptor de conexión en el modo de RF de 2,4 GHz.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Mantenga presionado el botón de función durante 15 segundos hasta que escuche indicaciones audibles.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Desenchufe y vuelva a insertar el receptor de RF de 2,4 GHz. Apague el dispositivo y, a continuación, cambie el dispositivo al modo de RF de 2,4 GHz.